In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
label = ['a','b','c']

my_data =[10,20,30]

arr = np.array(my_data)

d = {'a':10,'b':20,'c':30}

In [103]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [106]:
ser1 = pd.Series(my_data, label)

In [107]:
ser1

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(label,my_data)

10    a
20    b
30    c
dtype: object

In [108]:
ser1[2]

30

In [112]:
adata = [12,32,42]

In [113]:
ser2 = pd.Series(adata,['a','f','c'])

In [114]:
ser1 + ser2

a    22.0
b     NaN
c    72.0
f     NaN
dtype: float64

In [12]:
ser1 + ser2

a    22.0
b     NaN
c    72.0
f     NaN
dtype: float64

In [115]:
from numpy.random import randn, randint

In [130]:
np.random.seed(101)

In [131]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [132]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [134]:
df[['Y', 'Z', 'X']]

          Y         Z         X
A  0.907969  0.503826  0.628133
B -0.848077  0.605965 -0.319318
C  0.528813 -0.589001  0.740122
D -0.933237  0.955057 -0.758872
E  2.605967  0.683509  1.978757

In [137]:
df['NEW'] = df['W'] + df['Y']

In [138]:
df

          W         X         Y         Z        WY       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762  2.796762

In [139]:
df.drop('WY',axis=1,inplace=True)

In [140]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [141]:
df.drop('E',axis=0)

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [142]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [147]:
df.loc['C']

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
NEW   -1.489355
Name: C, dtype: float64

In [144]:
df.iloc[2]

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
NEW   -1.489355
Name: C, dtype: float64

In [25]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [26]:
df[['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.loc[['C'],['Y']]

          Y
C  0.528813

In [29]:
df.loc[['C','A']]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
A  2.706850  0.628133  0.907969  0.503826

In [30]:
df.loc[['A','C','E'],['W','X','Z']]

          W         X         Z
A  2.706850  0.628133  0.503826
C -2.018168  0.740122 -0.589001
E  0.190794  1.978757  0.683509

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [33]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df['W'] >0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df[df['Y']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df[df['W']>0].iloc[[0,3]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

To reset index of your data frame to original values(your former index will become a column on the data frame)

In [40]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

You can also assign new indexes by first making it a new

In [41]:
newind = 'CA CB CC CD CE'.split()

In [42]:
df['ind'] = newind

In [43]:
df

          W         X         Y         Z ind
A  2.706850  0.628133  0.907969  0.503826  CA
B  0.651118 -0.319318 -0.848077  0.605965  CB
C -2.018168  0.740122  0.528813 -0.589001  CC
D  0.188695 -0.758872 -0.933237  0.955057  CD
E  0.190794  1.978757  2.605967  0.683509  CE

In [44]:
df.set_index('ind')

            W         X         Y         Z
ind
CA   2.706850  0.628133  0.907969  0.503826
CB   0.651118 -0.319318 -0.848077  0.605965
CC  -2.018168  0.740122  0.528813 -0.589001
CD   0.188695 -0.758872 -0.933237  0.955057
CE   0.190794  1.978757  2.605967  0.683509

In [45]:
df

          W         X         Y         Z ind
A  2.706850  0.628133  0.907969  0.503826  CA
B  0.651118 -0.319318 -0.848077  0.605965  CB
C -2.018168  0.740122  0.528813 -0.589001  CC
D  0.188695 -0.758872 -0.933237  0.955057  CD
E  0.190794  1.978757  2.605967  0.683509  CE

In [46]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [47]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
df1 = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [49]:
df1

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [50]:
df1.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [51]:
df1['AB'] = df1['A'] + df1['B']

In [52]:
df1

             A         B        AB
G1 1  0.302665  1.693723  1.996388
   2 -1.706086 -1.159119 -2.865205
   3 -0.134841  0.390528  0.255687
G2 1  0.166905  0.184502  0.351406
   2  0.807706  0.072960  0.880666
   3  0.638787  0.329646  0.968433

In [53]:
df1['AB']

G1  1    1.996388
    2   -2.865205
    3    0.255687
G2  1    0.351406
    2    0.880666
    3    0.968433
Name: AB, dtype: float64

In [54]:
df1.loc['G2'][['A','AB']]

          A        AB
1  0.166905  0.351406
2  0.807706  0.880666
3  0.638787  0.968433

To name the indexes, use dataframename.index.names = [ the name(s) in strings, seperated with commas]

In [55]:
df1.index.names = ['Groups','num']

In [56]:
df1

                   A         B        AB
Groups num
G1     1    0.302665  1.693723  1.996388
       2   -1.706086 -1.159119 -2.865205
       3   -0.134841  0.390528  0.255687
G2     1    0.166905  0.184502  0.351406
       2    0.807706  0.072960  0.880666
       3    0.638787  0.329646  0.968433

In [57]:
df1.loc['G2'].loc[2]['B']

0.07295967531703869

In [58]:
df1.loc['G1'].loc[[1,2]]['AB']

num
1    1.996388
2   -2.865205
Name: AB, dtype: float64

In [59]:
df1.xs(3,level='num')

               A         B        AB
Groups
G1     -0.134841  0.390528  0.255687
G2      0.638787  0.329646  0.968433

In [60]:
df1.xs('G2')

            A         B        AB
num
1    0.166905  0.184502  0.351406
2    0.807706  0.072960  0.880666
3    0.638787  0.329646  0.968433

In [61]:
d1 = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3],'D':[3,4,5]}

In [62]:
df2 = pd.DataFrame(d1)

In [63]:
df2.dropna()

     A    B  C  D
0  1.0  5.0  1  3

In [64]:
df2

     A    B  C  D
0  1.0  5.0  1  3
1  2.0  NaN  2  4
2  NaN  NaN  3  5

In [65]:
df2.dropna(axis=1)

   C  D
0  1  3
1  2  4
2  3  5

In [66]:
df2.dropna(thresh=2)

     A    B  C  D
0  1.0  5.0  1  3
1  2.0  NaN  2  4
2  NaN  NaN  3  5

In [67]:
df2.dropna(axis=1,thresh=2)

     A  C  D
0  1.0  1  3
1  2.0  2  4
2  NaN  3  5

In [68]:
df2

     A    B  C  D
0  1.0  5.0  1  3
1  2.0  NaN  2  4
2  NaN  NaN  3  5

In [69]:
df2.fillna(value='FILL')

      A     B  C  D
0   1.0   5.0  1  3
1   2.0  FILL  2  4
2  FILL  FILL  3  5

In [70]:
df2['A'].fillna(value = df2['A'].mean(),inplace=True)

In [71]:
df2

     A    B  C  D
0  1.0  5.0  1  3
1  2.0  NaN  2  4
2  1.5  NaN  3  5

In [72]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [73]:
df3 = pd.DataFrame(data)

In [74]:
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [75]:
df3.groupby('Company')['Sales'].sum()

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

In [76]:
df3.groupby('Company')['Sales'].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [77]:
df3.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [78]:
df3.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [79]:
df3.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [80]:
df3.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [81]:
df3.groupby('Company').describe().loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [82]:
df3.groupby('Company').describe().loc[['FB','MSFT']]

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

Check out concatnation(which I like and get), merging and joining of dataframes

In [83]:
df_c = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df_c.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [84]:
df_c

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [85]:
df_c['col2'].unique()

array([444, 555, 666], dtype=int64)

In [86]:
df_c['col2'].nunique()

3

In [87]:
df_c['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [88]:
df_c[df_c['col1']>1]

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [89]:
df_c['col1']>1

0    False
1     True
2     True
3     True
Name: col1, dtype: bool

In [90]:
df_c[(df_c['col1']>1) & (df_c['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [91]:
df_c.index.names = ['indx']

In [92]:
df_c

      col1  col2 col3
indx
0        1   444  abc
1        2   555  def
2        3   666  ghi
3        4   444  xyz

*YOU CAN APPLY LAMBDA EXPRESSIONS OR ANY OTHER METHOD,BUT MOSTLY USEFUL WITH LAMBDA EXPRESSIONS BY USING* .apply(the expression)

In [93]:
df_c['col2'].apply(lambda x:x**2)

indx
0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [94]:
df_c.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [95]:
df_c.index

RangeIndex(start=0, stop=4, step=1, name='indx')

In [96]:
df_c.sort_values(by='col2')

      col1  col2 col3
indx
0        1   444  abc
3        4   444  xyz
1        2   555  def
2        3   666  ghi

In [97]:
df_c.isnull()

       col1   col2   col3
indx
0     False  False  False
1     False  False  False
2     False  False  False
3     False  False  False

In [98]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df4 = pd.DataFrame(data)

In [99]:
df4

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [100]:
df4.pivot_table(index=['A','B'],values='D',columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [101]:
pd.read_excel('excel_sample',sheet1)

NameError: name 'sheet1' is not defined